#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
*** Run the program
In order to run this you have to "tangle" the code first using =C-c
C-v C-t=.

#+BEGIN_SRC shell :tangle no :results output :exports both
  cd ada
  gnatmake day01
  ./day01
#+END_SRC

#+RESULTS:
: Advent of Code 2021 - Day 01:
: 
: The result for part 1 is:  1342
: The result for Part 2 is:  1378
